src/DataProcessors/ImportFromADP.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<DataProcessor>
		<Properties>
			<Name>ImportFromADP</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Documents/GeneralJournalEntry.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>GeneralJournalEntry</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CashFlowData</xr:Item>
				<xr:Item>AccumulationRegister.ClassData</xr:Item>
				<xr:Item>AccumulationRegister.ProjectData</xr:Item>
				<xr:Item>AccountingRegister.GeneralJournal</xr:Item>
				<xr:Item>AccumulationRegister.BankReconciliation</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotalRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ARorAP</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GJEntryType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Adjusting</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VoidingEntry</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Check</v8:Type>
						<v8:Type>cfg:DocumentRef.InvoicePayment</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotReconcile</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>gh_descr</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LineItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Account</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AmountDr</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AmountCr</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Memo</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Company</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Companies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Class</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Classes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Project</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Projects</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VoidedEntry</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.SalesReturn</v8:Type>
								<v8:Type>cfg:DocumentRef.Check</v8:Type>
								<v8:Type>cfg:DocumentRef.PurchaseInvoice</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ChartsOfAccounts/ChartOfAccounts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<ChartOfAccounts>
		<Properties>
			<Name>ChartOfAccounts</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.Dimensions</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AccountType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AccountTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Category1099</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.USTaxCategories1099</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashFlowSection</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CashFlowSections</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreditCard</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReclassAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashFromOperations</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RCL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RetainedEarnings</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>gc_rectype</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>gc_totlev</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

src/DataProcessors/ImportFromADP/Forms/Form/Ext/Form/Module.bsl
&AtClient
Procedure FileUpload(Command)
	
	Notify = New NotifyDescription("ExcelFileUpload", ThisForm);

	BeginPutFile(Notify, "", "*.xls", True, ThisForm.UUID);
	
EndProcedure

&AtClient
Procedure ListRefClick(Item)
	
	OpenForm("Document.GeneralJournalEntry.ListForm");
	Close();
	
EndProcedure

///////////////////////////////////
&AtClient
Procedure ExcelFileUpload(Result, Address, SelectedFileName, AdditionalParameters) Export
	
	If (Find(SelectedFileName, ".xls") = 0)
		And (Find(SelectedFileName, ".xlsx") = 0)
		And (Find(SelectedFileName, ".XLS") = 0)
		And (Find(SelectedFileName, ".XLSX") = 0)
		Then
		ShowMessageBox(, NStr("en = 'Please upload a valid Excel file (.xls, .xlsx)'"));
		Return;
	EndIf;
	
	If ValueIsFilled(Address) Then
		ShowUserNotification(NStr("en = 'Reading file with  Microsoft Excel...'"));
		Errors = False;
		ImportData(Address);
	EndIf;
	
	If Not Errors Then 
		Items.FileUpload.Visible = False;
		Items.Group1.Visible     = True;   
		ThisForm.CurrentItem     = Items.ListRef;
		ShowMessageBox(,NStr("en = 'Done!'"));
	EndIf;
	
EndProcedure

&AtServer
Procedure ImportData(TempStorageAddress)
	
	BinaryData = GetFromTempStorage(TempStorageAddress);
	TempFileName = GetTempFileName("xls");
	BinaryData.Write(TempFileName);

	Try
        COMExcel = New COMObject("Excel.Application");
        Excel = COMExcel.Application.WorkBooks.Open(TempFileName);
        ExcelSheet = Excel.Sheets(1);
	Except
		ErrorDescription = ErrorDescription();
       	CommonUseClientServer.MessageToUser(NStr("en = 'An error occurred. Details:'") + ErrorDescription);
		
		Errors = True;
        Return;
	EndTry;
	
	//Clear collections
	VT = New ValueTable();
	VT.Columns.Add("DateTransaction", New TypeDescription("Date"));
	VT.Columns.Add("AccountNumber",  New TypeDescription("String"));
	VT.Columns.Add("Amount", New TypeDescription("Number"));
	
	RowNumber = 1;
	
	While True Do
		
		RowNumber = RowNumber + 1;
		
		DateTransaction = ExcelSheet.Cells(RowNumber, 5).Value;
		AccountNumber   = ExcelSheet.Cells(RowNumber, 2).Text;
		Amount          = ExcelSheet.Cells(RowNumber, 4).Value;
		
		If Not ValueIsFilled(DateTransaction) Then
			Break;
		EndIf;
		
		RowVT = VT.Add();
		RowVT.DateTransaction = DateTransaction;
		RowVT.AccountNumber   = AccountNumber;
		RowVT.Amount          = Amount;
		
	EndDo;
	
	Excel.Close();
	
	CreateGJE(VT);
	
EndProcedure

&AtServer
Procedure CreateGJE(VT)
	
	//Check accounts
	ErrorAccounts = New ValueList;
	
	For Each RowVT In VT Do
		FoundAccount = ChartsOfAccounts.ChartOfAccounts.FindByCode(RowVT.AccountNumber);
		
		If FoundAccount = Undefined Or FoundAccount = ChartsOfAccounts.ChartOfAccounts.EmptyRef() Then
			If ErrorAccounts.FindByValue(RowVT.AccountNumber) = Undefined Then
				ErrorAccounts.Add(RowVT.AccountNumber);	
			EndIf;
		EndIf;
	EndDo;
	
	If ErrorAccounts.Count() > 0 Then
		For Each RowErrorAccounts In ErrorAccounts Do
			TextMessage = StringFunctionsClientServer.SubstituteParametersInString(NStr("en = 'Code of account %1 is not found!'"), RowErrorAccounts);
			CommonUseClientServer.MessageToUser(TextMessage);
		EndDo;
		
		Errors = True;
		Return;
	EndIf;
	
	//Create documents
	VT.Sort("DateTransaction");
	
	If VT.Count() = 0 Then
		TextMessage = NStr("en = 'There is no data in the file!'");
		CommonUseClientServer.MessageToUser(TextMessage);
		
		Errors = True;
		Return;
	EndIf;
	
	FirstRow        = True;
	DateTransaction = Undefined;
	
	For Each RowVT In VT Do
		
		If FirstRow Then
			
			FirstRow        = False;
			DateTransaction = RowVT.DateTransaction;
			
			//Add document
			NewGJ = Documents.GeneralJournalEntry.CreateDocument();
			NewGJ.Date = RowVT.DateTransaction;
			NewGJ.Memo = "Import from ADP (auto-created)";
			
			//Add row
			NewGJLine = NewGJ.LineItems.Add();
			NewGJLine.Account = ChartsOfAccounts.ChartOfAccounts.FindByCode(RowVT.AccountNumber);
			If RowVT.Amount > 0 Then
				NewGJLine.AmountDr = RowVT.Amount;
			Else
				NewGJLine.AmountCr = -RowVT.Amount;
			EndIf;
			
		ElsIf DateTransaction <> RowVT.DateTransaction Then
			
			DateTransaction = RowVT.DateTransaction;
			
			//Finish document
			DocTotal = NewGJ.LineItems.Total("AmountDr");
			NewGJ.DocumentTotalRC = DocTotal;
			NewGJ.DocumentTotal   = DocTotal;
			NewGJ.Currency        = GeneralFunctionsReusable.DefaultCurrency();
			NewGJ.ExchangeRate    = 1;
			NewGJ.Write();
			
			//Add document
			NewGJ = Documents.GeneralJournalEntry.CreateDocument();
			NewGJ.Date = RowVT.DateTransaction;
			NewGJ.Memo = "Import from ADP (auto-created)";
			
			//Add row
			NewGJLine = NewGJ.LineItems.Add();
			NewGJLine.Account = ChartsOfAccounts.ChartOfAccounts.FindByCode(RowVT.AccountNumber);
			If RowVT.Amount > 0 Then
				NewGJLine.AmountDr = RowVT.Amount;
			Else
				NewGJLine.AmountCr = -RowVT.Amount;
			EndIf;
			
		Else
			
			//Add row
			NewGJLine = NewGJ.LineItems.Add();
			NewGJLine.Account = ChartsOfAccounts.ChartOfAccounts.FindByCode(RowVT.AccountNumber);
			If RowVT.Amount > 0 Then
				NewGJLine.AmountDr = RowVT.Amount;
			Else
				NewGJLine.AmountCr = -RowVT.Amount;
			EndIf;
			
		EndIf; 	
		
	EndDo;
	
	If Not FirstRow Then   
		
		//Finish document
		DocTotal = NewGJ.LineItems.Total("AmountDr");
		NewGJ.DocumentTotalRC = DocTotal;
		NewGJ.DocumentTotal   = DocTotal;
		NewGJ.Currency        = GeneralFunctionsReusable.DefaultCurrency();
		NewGJ.ExchangeRate    = 1;
		NewGJ.Write();
		
	EndIf;
	
EndProcedure
